{
  "data": [
    {
      "id": "bastion",
      "name": "Bastion",
      "description": "A massive, heavily armored ARC unit, built around a terrifying, fully automatic minigun. It rarely moves without air support overhead, which helps it pin down and suppress Raider movement. Listen for its loud, distinct screech—that's your warning before it unleashes a three-second hail of bullets toward the last known enemy position.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/bastion.webp",
      "image": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/images/bastion.webp",
      "created_at": "2025-10-08T11:16:51.624713+00:00",
      "updated_at": "2025-11-04T15:53:56.05961+00:00"
    },
    {
      "id": "bombardier",
      "name": "Bombardier",
      "description": "The Bombardier is an armored ARC that functions as heavy, mobile artillery. Its movement is slow and loud. Armed with a multi-rocket launcher, it unleashes devastating, long-range barrages that can obliterate your entire squad. Do not engage this unit. If you hear its grinding approach, silence your movement and escape the area immediately, as its attention is a death sentence.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/bombardier.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/bombardier.webp",
      "created_at": "2025-10-22T14:25:32.537307+00:00",
      "updated_at": "2026-02-09T15:49:04.408481+00:00"
    },
    {
      "id": "comet",
      "name": "Comet",
      "description": "Often found guarding heavy machines, the Comet serves as a brutal deterrent against Raiders who attempt flanking tactics. When it acquires a target it accelerates with alarming speed, and triggers its self-destruct once it's near enough to guarantee damage.\n\nIts blast radius is generous and unforgiving, as grouped-up squads have learned the hard way. Its armor plating protects its core, but it opens up when it charges, exposing its vulnerable innards. However, even when exposed, hitting such a fast-moving weak spot requires a particularly skilled trigger finger.\n\nExperienced Raiders treat the Comet as a priority target, dropping it before engaging whatever it's protecting. The alternative is fighting a Bastion while a live bomb circles for an opening. Shani suspects ARC deployed them specifically in response to Raider flanking tactics - another sign that the machines are learning",
      "icon": "https://cdn.metaforge.app/arc-raiders/icons/comet.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/comet.webp",
      "created_at": "2026-02-23T17:10:27.277136+00:00",
      "updated_at": "2026-02-24T19:03:58.830776+00:00"
    },
    {
      "id": "fireball",
      "name": "Fireball",
      "description": "A small armored rolling ARC that spits flame. Will open up it's front panel when near Raiders to burn them alive. While the front is open its soft unarmored core is exposed.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/fireball.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/fireball.webp",
      "created_at": "2025-10-08T12:06:35.605684+00:00",
      "updated_at": "2025-12-09T19:56:31.920703+00:00"
    },
    {
      "id": "firefly",
      "name": "Firefly",
      "description": "A nastier relative to the standard Hornet, it trades its electric shock for a flamethrower capable of engulfing Raiders in seconds. Its heavy plating makes it just as difficult to bring down as its shocking sibling, but the threat it poses up close is considerably worse.\n\nThey sometimes join regular Hornets and Wasp on their patrols. They often hang back until a raider is already engaged before swooping in to flush them from cover. Veterans have learned to pick them out early - the fuel tank gives them a slightly different flight profile.\n\nThe flamethrower fuel tank is also their weakness. A well-placed shot turns the machine into a brief but spectacular fireball. Some Raiders have taken to igniting them deliberately near other ARC machines, though the timing required makes this a gambler's trick.\n\nApollo has been seen tinkering with its parts for weeks, muttering something about \"portable heating solutions.\"",
      "icon": "https://cdn.metaforge.app/arc-raiders/icons/firefly.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/firefly.webp",
      "created_at": "2026-02-23T17:10:07.695749+00:00",
      "updated_at": "2026-02-25T11:12:55.827868+00:00"
    },
    {
      "id": "hornet",
      "name": "Hornet",
      "description": "This is a medium-class drone, easily recognizable by the pair of armored rotors mounted prominently on its front. It rarely operates alone, preferring to patrol the skies alongside a swarm of Wasps or to act as an aerial shield for a larger, ground-based ARC. Its main attack is a focused, high-speed projectile. Watch for the brief, one-second pulse of a red aiming laser—that's your warning before it fires a specialized stun round designed to shred Raider shields and tear through light armor almost instantly.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/hornet.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/hornet.webp",
      "created_at": "2025-10-08T12:02:46.903538+00:00",
      "updated_at": "2026-02-09T15:51:02.652697+00:00"
    },
    {
      "id": "bison",
      "name": "Leaper",
      "description": "This isn't just an ARC; it's a massive, arachnid-like siege engine. Its heavy armor gives it a hulking, near-indestructible presence on the battlefield, but don't mistake its bulk for sluggishness. This mechanized spider possesses an unnerving, gravity-defying ability to leap vast distances. Reports confirm it has been seen clearing impossible gaps, even bounding effortlessly to the summit of a Spaceport tower. It's a vertical threat you can't simply hide from.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/bison.webp",
      "image": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/images/bison.webp",
      "created_at": "2025-10-08T10:52:03.833747+00:00",
      "updated_at": "2025-11-04T15:59:18.743003+00:00"
    },
    {
      "id": "matriarch",
      "name": "Matriarch",
      "description": "The head of the Family. This ARC shoots rockets, gas and has big shield. She will also spawn her Leapers, Bastions, Fireballs, Hornets and Wasps.",
      "icon": "https://cdn.metaforge.app/arc-raiders/icons/matriarch.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/matriarch.webp",
      "created_at": "2025-11-12T19:34:45.361835+00:00",
      "updated_at": "2025-12-09T15:31:04.305795+00:00"
    },
    {
      "id": "pop",
      "name": "Pop",
      "description": "The Pop is a small, unarmored rolling machine. It's a quick, impulsive enemy that often roams in swarms. Often found indoors, the Pop's purpose is thought to be clearing out rubble and blockages that may inhibit ARC's operations. The Pop seems to have little regard for its own safety; carrying an explosive charge that \"pops\" upon impact, scorching any Raider that lets it get too close.",
      "icon": "https://cdn.metaforge.app/arc-raiders/icons/pop.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/pop.webp",
      "created_at": "2025-10-08T12:05:37.972313+00:00",
      "updated_at": "2025-12-09T19:55:04.079569+00:00"
    },
    {
      "id": "queen",
      "name": "Queen",
      "description": "This is the Goliath of the ARC forces, a colossal machine whose presence defines the battlefield. It is only deployed during the critical Harvester Event, acting as the immovable guardian of the Harvester unit. Its incredible durability and lethal arsenal make it the single greatest threat on the map; attempting to scratch its armor alone is a fool's errand—you'll need a full squad of Raiders working in concert just to stand a chance.\n\nIts attacks are devastating:\n\nMortar Barrage: The dome atop the unit launches three massive mortars that land in a cluster around a targeted Raider. Two seconds after impact, they detonate in a fiery, engulfing inferno.\n\nSustained Laser: It periodically sweeps its primary weapon, firing a continuous laser beam at any Raider it acquires in its line-of-sight.\n\nClose-Quarters Deterrents: Should Raiders try to get up close and personal, the Goliath switches modes, delivering either a disruptive EMP pulse to shut down technology or a crushing ground slam to obliterate anything nearby.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/queen.webp",
      "image": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/images/queen_image.jpg",
      "created_at": "2025-10-08T07:57:53.043251+00:00",
      "updated_at": "2025-12-09T15:34:31.669525+00:00"
    },
    {
      "id": "rocketeer",
      "name": "Rocketeer",
      "description": "This is a formidable flying ARC, a pure engine of destruction that dominates the airspace. It poses a significant threat not just because it flies, but because of its powerful rocket attacks and devastating focus on area-of-effect (AoE) damage. This unit is designed to saturate an area, turning cover into a liability and forcing Raiders to constantly relocate or be wiped out by the sheer force of its explosions. Treat it like a mobile artillery piece—it hits hard and wide.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/rocketeer.webp",
      "image": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/images/rocketeer.webp",
      "created_at": "2025-10-08T11:08:06.812016+00:00",
      "updated_at": "2025-11-04T16:34:17.984429+00:00"
    },
    {
      "id": "sentinel",
      "name": "Sentinel",
      "description": "A large unarmored turret that sits atop buildings and ledges. Often found outside and usually very high up. Contains a small vulnerable capsule attached to its swiveling arm.\n\nTraces movement and will fire off a single Heavy round every 5 seconds while having line-of-sight on a Raider.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/sentinel.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/sentinel.webp",
      "created_at": "2025-10-08T11:30:48.243119+00:00",
      "updated_at": "2026-02-09T15:52:48.243707+00:00"
    },
    {
      "id": "shredder",
      "name": "Shredder",
      "description": "When this relentless lump of menace was first encountered at the Stella Montis facility, it left behind a trail of downed Raiders. It was dubbed the \"Shredder\" by what few Raiders managed to get back to safety; a name that wasn't so much clever as it was painfully literal.",
      "icon": "https://cdn.metaforge.app/arc-raiders/icons/shredder.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/shredder.webp",
      "created_at": "2025-11-12T19:35:03.207409+00:00",
      "updated_at": "2025-11-14T18:52:50.170349+00:00"
    },
    {
      "id": "snitch",
      "name": "Snitch",
      "description": "This little flyer is a swift and unarmored scout drone, often identifiable by its cluster of three rotors. While individually fragile, its primary danger is its role as an aerial alarm system. Once it spots Raiders, it immediately triggers a wide-band signal, effectively calling in a wave of flying ARC reinforcements—usually a swarm of Wasps or Hornets—to descend on your position. Taking it out before it completes its transmission is essential, as its light frame means a single, well-aimed burst will shatter it.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/snitch.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/snitch.webp",
      "created_at": "2025-10-08T12:03:30.869636+00:00",
      "updated_at": "2026-02-09T15:50:31.745901+00:00"
    },
    {
      "id": "spotter",
      "name": "Spotter",
      "description": "Often compared to the Snitch, the Spotter reconnaissance drone patrols and scans for Raiders. While it does not call in reinforcements directly, it does make a lot of fuss while relaying Raider positions to other ARC machines.\n\nDespite its size, the Spotter can take considerable punishment. Combined with its unpredictable flight patterns, it's a frustrating opponent to pin down.\n\nHunting Spotters creates commotion and might draw the attention of oportunistic Raiders looking to eliminate the competition.",
      "icon": "https://cdn.metaforge.app/arc-raiders/icons/spotter.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/spotter.webp",
      "created_at": "2026-01-19T05:44:03.092886+00:00",
      "updated_at": "2026-01-19T22:55:47.584583+00:00"
    },
    {
      "id": "rollbot",
      "name": "Surveyor",
      "description": "This is the largest of the rolling ARCs, a massive, spherical construct designed to dominate open ground. Its primary tactic is to stop periodically on the battlefield to transmit disruptive signals, acting as a massive relay for the ARC network. Be warned, however, its most unique (and dangerous) trait is its resilience: as it takes damage, its outer shell breaks apart into many smaller, armored pieces. Its final attack is a relentless one: it will roll directly at high speed toward any Raider it detects, essentially turning itself into a giant, high-impact bowling ball.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/rollbot.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/rollbot.webp",
      "created_at": "2025-10-08T11:32:47.592365+00:00",
      "updated_at": "2026-02-12T16:11:00.268536+00:00"
    },
    {
      "id": "tick",
      "name": "Tick",
      "description": "This terrifying enemy, often called the Tick, is a small, unarmored ARC that specializes in the perfect ambush. It uses dark, indoor spaces—particularly the undersides of ceilings and dark corners of walls—as its hunting ground. It waits in absolute stillness until a Raider passes underneath. Then, without warning, it lunges for your head, aiming to latch directly onto your face or helmet. Once attached, it relentlessly drains your health and shield meter simultaneously. The panic is compounded by the fact that you must hold the [Interact] button to forcibly pry the parasite off, an agonizing process that leaves you exposed to other threats.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/tick.webp",
      "image": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/images/tick.webp",
      "created_at": "2025-10-08T12:04:19.284698+00:00",
      "updated_at": "2025-10-08T15:31:29.666707+00:00"
    },
    {
      "id": "turret",
      "name": "Turret",
      "description": "This is a small, unarmored turret that provides close-quarters defense for the ARC. Its primary function is to scan constantly for movement, and you’ll typically find it mounted on interior walls inside buildings. Do not confuse this swift little gun with the massive, high-altitude Sentinel turrets you find outside. When it spots a Raider, it immediately opens fire, unleashing a two-second hail of bullets in an attempt to suppress and eliminate the threat quickly. Its lack of armor makes it fragile, but its location makes it dangerous.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/turret.webp",
      "image": "https://cdn.metaforge.app/arc-raiders/images/turret.webp",
      "created_at": "2025-10-08T11:31:30.853228+00:00",
      "updated_at": "2026-02-09T14:58:45.316789+00:00"
    },
    {
      "id": "wasp",
      "name": "Wasp",
      "description": "This is the Wasp, a baseline enemy drone that poses a threat through sheer numbers. It is a small, unarmored flyer that peppers Raiders with light-caliber ammunition. You'll almost never encounter a Wasp alone; they operate in tight patrols alongside other Wasps or as escorts for their more dangerous counterpart, the Hornet. The moment it turns aggressive, look for a small red laser to lock onto you for one second—that's your cue to dodge before it unleashes a quick 1.5-second burst of gunfire.",
      "icon": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/icons/wasp.webp",
      "image": "https://unhbvkszwhczbjxgetgk.supabase.co/storage/v1/object/public/images/arc-raiders/images/wasp.webp",
      "created_at": "2025-10-07T12:09:38.554285+00:00",
      "updated_at": "2025-11-04T00:46:26.3945+00:00"
    }
  ],
  "pagination": {
    "page": 1,
    "limit": 50,
    "total": 19,
    "totalPages": 1,
    "hasNextPage": false,
    "hasPrevPage": false
  }
}